{
  "experience": {
    "title": "Experience",
    "shortText": "My expertise encompasses game design, database administration, and testing for quality assurance. From crafting immersive gaming experiences to ensuring data integrity and product functionality, I've developed a versatile skill set to tackle diverse challenges in technology and innovation.",
    "body": [
      {
        "id": "1",
        "subTitle": "Game Design",
        "text": "I've honed my skills in crafting immersive gaming experiences by meticulously considering, planning, and detailing every element of a game. From conceptualizing and expanding game concepts to managing tasks for developers, I've led teams in transforming rough ideas into detailed concepts and implementing them into engaging gameplay. My expertise extends to collaborating with User Experience (UX) and User Interface (UI) Designers to optimize player interfaces, ensuring seamless and intuitive interactions. Moreover, I've conducted extensive market research to understand the desires of target audiences, driving the creation of innovative and captivating game experiences."
      },
      {
        "id": "2",
        "subTitle": "Database Administration",
        "text": "My experience in database administration includes proficiency in working with database software to store, organize, and manage data effectively. From designing and developing databases to implementing maintenance procedures, I've ensured the reliability and efficiency of data storage systems. Additionally, I've excelled in monitoring performance statistics, conducting data extraction and examination, and generating comprehensive reports to support informed decision-making."
      },
      {
        "id": "3",
        "subTitle": "Testing and Quality Assurance",
        "text": "In testing and quality assurance (QA), I've taken on leadership roles, overseeing teams of game testers to analyze feedback and locate potential defects. Through meticulous testing, bug analysis, and verification processes, I've ensured the integrity of game functionality while managing devices and hardware to maintain optimal gaming experiences. Moreover, I've specialized in game balancing, fine-tuning gameplay mechanics to deliver rewarding and enjoyable experiences for players."
      },
      {
        "id": "4",
        "subTitle": "Web Development",
        "text": "My journey in web development has equipped me with a robust understanding of front-end and back-end technologies. I have designed and implemented user-friendly websites, ensuring optimal performance and responsiveness. Collaborating with designers, I've created intuitive interfaces that enhance user experience, while also maintaining the technical integrity and security of the applications."
      },
      {
        "id": "5",
        "subTitle": "Career Overview",
        "text": "Throughout my journey, I've embodied resilience, curiosity, and a relentless pursuit of excellence, driving innovation and fostering success in the dynamic and ever-evolving field of software development. With a comprehensive understanding of game design, database administration, testing and QA, and web development, I eagerly anticipate the myriad opportunities that lie ahead as I continue to push the boundaries of creativity and innovation in the gaming industry."
      }
    ]
  },
  "education": {
    "title": "Education",
    "shortText": "My educational journey began at high school in Subotica, where I developed a strong technical foundation. I furthered my skills at a bootcamp before pursuing studies at a college in Subotica. Seeking an international perspective, I then attended an university in Linz, Austria. Each step has shaped my expertise and worldview, guiding me towards my aspirations.",
    "body": [
      {
        "id": "1",
        "subTitle": "Technical School 'Ivan Sarić'",
        "text": "My journey into the captivating realm of software development commenced at Technical School 'Ivan Sarić' in Subotica, a pivotal moment where I was first introduced to the intricacies of programming and software creation. It was here that I laid the groundwork, acquiring essential knowledge and skills that would form the cornerstone of my career."
      },
      {
        "id": "2",
        "subTitle": "IT Academy",
        "text": "Upon completing high school in 2018, I made the decision to relocate to Belgrade, enticed by a promising opportunity at a company that recognized my potential. Concurrently, I seized the chance to further hone my expertise by enrolling in a year-long IT academy program. I specialized in web development, delving deep into the intricacies of front-end and back-end technologies. The program not only expanded my technical proficiency but also instilled in me a passion for crafting innovative solutions through software development, which I eagerly applied to my work."
      },
      {
        "id": "3",
        "subTitle": "Subotica Tech College",
        "text": "However, the year 2020 brought unforeseen challenges with the onset of the global pandemic. Forced to adapt, I made the decision to relocate back to Subotica, transitioning seamlessly into remote work. With newfound flexibility and time at my disposal, I seized the opportunity to further enrich my academic journey by enrolling in the Higher Technical School of Professional Studies in Subotica. Here, I delved into advanced topics in computer science, refining my understanding of algorithms, data structures, and software architecture."
      },
      {
        "id": "4",
        "subTitle": "Johannes Kepler University",
        "text": "In early 2022, my dedication and academic prowess culminated in a remarkable opportunity - participation in the prestigious Central European Exchange program at Johannes Kepler University in Linz, Austria. Embarking on this transformative journey, I spent six months immersed in a rich academic environment, surrounded by brilliant minds and cutting-edge research. The experience broadened my horizons, exposing me to diverse perspectives and innovative approaches in software development. From collaborative projects to intensive coursework, every moment was a learning opportunity, shaping me into a more adept and well-rounded professional. Upon my return to Subotica, I was honored with the offer to extend my stay in Linz for another semester, a testament to my academic achievements and contributions. Embracing this continuation of my international adventure, I delved deeper into specialized areas of computer science, engaging in rigorous research and academic discourse. The culmination of my studies in Linz marked a significant milestone in my academic journey, paving the way for my return to Subotica to complete remaining exams and defend my thesis. In October 2023, with unwavering determination and scholarly rigor, I proudly graduated."
      }
    ]
  },
  "aboutMe": {
    "title": "About Me",
    "shortText": "I am a passionate software developer with a diverse range of experiences across various domains, including game design, database administration, and testing and QA. I am always eager to learn and push the boundaries of creativity and innovation in the gaming industry.",
    "body": [
      {
        "id": "1",
        "subTitle": "Begining",
        "text": "In the realm of game design, I've honed my skills in crafting immersive gaming experiences by meticulously considering, planning, and detailing every element of a game. From conceptualizing and expanding game concepts to managing tasks for developers, I've led teams in transforming rough ideas into detailed concepts and implementing them into engaging gameplay. My expertise extends to collaborating with User Experience (UX) and User Interface (UI) Designers to optimize player interfaces, ensuring seamless and intuitive interactions. Moreover, I've conducted extensive market research to understand the desires of target audiences, driving the creation of innovative and captivating game experiences."
      },
      {
        "id": "2",
        "subTitle": "Motivation",
        "text": "In the realm of database administration, I've demonstrated proficiency in working with database software to store, organize, and manage data effectively. From designing and developing databases to implementing maintenance procedures, I've ensured the reliability and efficiency of data storage systems. Additionally, I've excelled in monitoring performance statistics, conducting data extraction and examination, and generating comprehensive reports to support informed decision-making."
      },
      {
        "id": "3",
        "subTitle": "Future",
        "text": "In the realm of testing and quality assurance (QA), I've taken on leadership roles, overseeing teams of game testers to analyze feedback and locate potential defects. Through meticulous testing, bug analysis, and verification processes, I've ensured the integrity of game functionality while"
      }
    ]
  },
  "projects": {
    "title": "Projects",
    "shortText": "In my web projects, I've handled both front-end and back-end tasks, including database design, API creation, and UI/UX development. From team-based efforts like game development to solo ventures, I've focused on delivering cohesive digital solutions with a strong emphasis on functionality and user experience.",
    "body": [
      {
        "id": "1",
        "subTitle": "Awakening of Heroes",
        "text": "Working on 'Awakening of Heroes,' I've honed my skills in crafting immersive gaming experiences by meticulously considering, planning, and detailing every element of the game. From conceptualizing and expanding game concepts to managing tasks for developers, I've led teams in transforming rough ideas into detailed concepts and implementing them into engaging gameplay. My expertise extends to collaborating with User Experience (UX) and User Interface (UI) Designers to optimize player interfaces, ensuring seamless and intuitive interactions. Moreover, I've conducted extensive market research to understand the desires of target audiences, driving the creation of innovative and captivating game experiences. In addition to game design, I played a significant role in quality assurance, overseeing teams of game testers to analyze feedback and locate potential defects. Through meticulous testing, bug analysis, and verification processes, I ensured the integrity of game functionality. I also contributed to database administration, designing and developing databases to manage game data effectively and ensuring the reliability and efficiency of data storage systems."
      },
      {
        "id": "2",
        "subTitle": "Cinema Booking",
        "text": "In the cinema booking project, I gained extensive experience in both backend and frontend development. I created APIs to facilitate seamless communication between the frontend and backend, enabling dynamic alterations of web pages. My responsibilities included implementing features for booking cinema tickets when users selected their seats, managing reserved tickets and cinemas, and overseeing user account management. Additionally, I developed tools for administrators to manage cinema schedules and reservations efficiently. This project advanced my web development skills, giving me a comprehensive understanding of integrating various components to create a smooth, efficient, and user-friendly experience."
      },
      {
        "id": "3",
        "subTitle": "Tourist Agency",
        "text": "During my time with a tourist agency project, I gained extensive experience in various technologies and development processes. I researched React.js for web development, React Native for mobile apps, PHP for backend logic, and MySQL for database management. I created project plans, set up development environments, and developed both frontend and backend components. My work included implementing user registration, attraction search and display, and user rating systems. I ensured security with user authentication and protection against SQL injection and XSS attacks. Additionally, I conducted thorough testing and deployed the web and mobile applications to production. These experiences enhanced my skills in web and mobile development, backend management, and application security, providing a strong foundation for future projects."
      },
      {
        "id": "4",
        "subTitle": "Unbeatable Tic-Tac-Toe",
        "text": "Creating 'Unbeatable Tic-Tac-Toe' in React and implementing the Minimax algorithm to power an unbeatable AI was a rewarding challenge that combined the intricacies of game development with the logic of artificial intelligence. By utilizing React's component-based architecture, I represented each square of the Tic Tac Toe grid as a component, making the code modular and easy to manage. Integrating the Minimax algorithm added a layer of complexity, enabling the AI to analyze all possible moves and choose the optimal one, ensuring that it couldn't be defeated by human players. This project showcased my ability to combine modern web development techniques with AI to create engaging and challenging gaming experiences."
      }
    ]
  }
}
